{ "projects":
  {
    "1": {
      "key": "1",
      "title": "Dress To Impress",
      "languages": "Angular 4.0, Stripe API, Firebase",
      "url": "https://capstone-project-9ac28.firebaseapp.com/",
      "description": [
        {"text": "As a job seeker myself, I know that looking for a full-time job is not for the faint of heart. Even the smallest things can effect an impression. Since this is the case, I decided to mock up an online store that helps job seekers find professional-looking, worry-free clothing."},
        {"text": "My site features interview-worthy clothing for men and women of all ages. I used this project as an opportunity to play with the Stripe API. Stripe makes incorporating payments a cinch. The API even has a feature for Bitcoin payments, which I will have to explore in the future!"}
        ],
        "featuredPhoto": [{
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/dress2ImpressBackground.png?alt=media&token=a1ecc484-c54d-4e0b-9329-1f25b607f7e5",
          "alt": "",
          "text": ""
        }]
    },
    "2": {
      "key": "2",
      "title": "StartPup",
      "url": "https://github.com/eliseylenore/startpup",
      "languages": "Angular 2.0, Firebase, Bootstrap",
      "description": [
        {"text": "I built this website with a lovely group of students at Epicodus(coding bootcamp). I like to say it is like a LinkedIn for startups. The app allows users to showcase their skills and get resources and support they need to make their ideas a reality. It also provides an opportunity to share it with a vibrant community of people."},
        {"text": "My main role in this project was to create the models necessary. We had five different models to create: user, category, contact, need and project. My team talked about what would be necessary for each before creating the models. We also modified them quite a bit as we went along."},
        {"text": "My second task was to beautify the project using the Bootstrap front-end framework. I referred to Bootsnip, a website that showcases bits of Bootstrap code that people have used for different parts of their websites, such as the carousel or menu. Bootstrap really does make all styling so quick and easy!"}
        ],
        "featuredPhoto": [{
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/startPupBackground.png?alt=media&token=422649d2-df15-498a-8470-578d44d88451",
          "alt": "",
          "text": ""
        }

          ]
    },
    "3": {
      "key": "3",
      "title": "SQWAD Sports",
      "languages": "AngularJS, Firebase, Scss, Bootstrap",
      "description": [
        {"text": "In June and July 2017 I had the privilege of interning for SQWAD Sports. I worked remotely with the company's senior developer to implement the redesign of the app's Admin Portal. The first two weeks was largely using Scss and Bootstrap to make sure that everything looked pixel-perfect. During the next few weeks we fixed the functionality of the website using Typescript, a typed superset of JavaScript."},
        {"text": "We used Trello to ensure that every detail of the redesign was attended to. If I wasn't sure about what the senior developer wanted, I would ask him through Slack or through Trello comments. I used the Trello approach in my Capstone Project as well, as the platform helps me keep track of the order and priority of to-dos as I work."}
        ],
        "featuredPhoto": [{
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/dashboardBackground.png?alt=media&token=d183fe92-73dd-4437-aab3-058ed168c3e7",
          "alt": "SQWAD Dashboard"
          }],
        "photos": [{
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/Dashboard.png?alt=media&token=e2a8c43a-ab21-46ce-a6c8-3d25a1a7ec80",
          "alt": "SQWAD Sports Admin Dashboard",
          "text": "The dashboard was the first element we styled and connected to data. The bar graph was surprisingly easy to make, thanks to MorrisJS. The four bottom tables were a different story. Not only did we have to style using tables (which in itself quite a task), but we also had a crash course in querying in Firebase."
        },
        {
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/Current%20Game.png?alt=media&token=7f9702e2-af15-4cfc-80d5-251eb4b967db",
          "alt": "Current Game page",
          "text": "As you can see, this website called for many differently styled buttons, each with different colors, sizes, padding and display. To help make the code cleaner and less confusing, I created a Scss mix-in that allows the programmer to create a custom button with ease. This was the first project where I was able to see the power of Scss."
        },
        {
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/Players%20Page.png?alt=media&token=25c67437-6635-4937-9fcd-2605a64f7f12",
          "alt": "Players Page",
          "text": "I relied heavily on Bootstrap styling to create the columns and panels for this page. A bit of custom CSS helped to ensure that the panels were the same height."
        },
        {
          "url": "https://firebasestorage.googleapis.com/v0/b/portfolio3-e9276.appspot.com/o/Edit%20Player.png?alt=media&token=c075c50f-3aca-4e32-a0c6-db5863cda553",
          "alt": "Edit Player pop up modal",
          "text": "We used modals on this site whenever something new needed to be created, edited or deleted. AngularUI Modal dialog calls for atleast two controllers on the page: one for the main controller and one for the modal instance. Bootstrap has modal classes specifically for building these modals, which was very helpful."
        }
        ]
    }
  }
}
